/*

درخت (Tree) یک ساختار داده سلسله‌مراتبی (Hierarchical Data Structure) هست.
شامل گره‌ها (Nodes) هست.
هر درخت یک ریشه (Root) داره.
هر گره می‌تونه فرزند (Children) داشته باشه.
گره‌هایی که فرزند ندارن → برگ (Leaf) نام دارن.

*/

/*
انواع پایه‌ای درخت

1) Binary Tree (درخت دودویی)
هر گره حداکثر ۲ فرزند داره → فرزند چپ و راست.

2) Binary Search Tree (BST)
نوع خاصی از درخت دودویی با شرط:
همه‌ی مقادیر سمت چپ < مقدار ریشه.
همه‌ی مقادیر سمت راست > مقدار ریشه.
کاربرد: جستجو، درج، حذف → به طور متوسط O(log n).
*/