/* 
O(1) => it means the operation takes constant time یعنی انجام عملیات زمان ثابتی مصرف میکند.
یعنی این زمان با افزایش دیتا تغییری نمیکند
var data = arr[2] مثل استخراج اندیس دوم یک آرایه
dictionary["key"] = 100;
*/


/*
O(n) => linear time یعنی زمان انجام عملیات مستقسما با افزایش دیتا، افزایش مییابد.
n معمولا اندازه ورودی است
اگر اندازه داده ها دو برابر شوند زمان هم دو برابر میشود
 */

int total = 0;
int i = 2;
while (i <= 10)
{
    total += i;
    i++;
}

/*
O(n^2) || O(n*m) => معمولا در حلقه های تو در تو منظور است
n معمولا اندازه ورودی است
اگر اندازه داده ها دو برابر شوند زمان هم دو برابر میشود
 */

for (int k = 0; k < 100; k++)
{
    for(int j = 0; j <90; j++)
    {
        Console.WriteLine(j);
    }
}